{
  "en": {
    "header-title": "22-Minute Daily Morning Workout & Stretch for Men",
    "header-subtitle": "No Equipment, No Mat Required",
    "filter-label": "Filter Routines:",
    "filter-pre-workout": "Pre-Workout Stretch",
    "filter-workout": "Workout",
    "filter-post-workout": "Post-Workout Stretch",
    "language-button": "Translate",
    "pre-workout-title": "7-Minute Pre-Workout Stretching Routine",
    "pre-workout-desc": "Start your session with this 7-minute dynamic stretching routine to warm up your muscles, improve mobility, and promote proper spinal and neck alignment. Perform each exercise for 1 minute, moving smoothly and breathing deeply.",
    "pre-workout-1-title": "1. Standing Cat-Cow Flow - 1 minute",
    "pre-workout-1-step1": "Stand with feet hip-width apart, knees slightly bent, hands on hips or thighs.",
    "pre-workout-1-step2": "Arch your back slightly, lifting your chest and tailbone (cow position), then round your spine, tucking chin to chest (cat position).",
    "pre-workout-1-step3": "Flow smoothly between these positions for 1 minute, keeping movements controlled.",
    "pre-workout-1-tip-label": "Tip:",
    "pre-workout-1-tip": "Focus on lengthening the spine and avoid hunching shoulders.",
    "pre-workout-2-title": "2. Neck Rolls - 1 minute",
    "pre-workout-2-step1": "Stand tall with feet hip-width apart, shoulders relaxed.",
    "pre-workout-2-step2": "Gently roll your head in a circular motion, starting by dropping your chin to your chest, then moving to the right, back, left, and forward.",
    "pre-workout-2-step3": "Complete 30 seconds clockwise, then 30 seconds counterclockwise.",
    "pre-workout-2-tip-label": "Tip:",
    "pre-workout-2-tip": "Move slowly to avoid strain and keep shoulders down.",
    "pre-workout-3-title": "3. Arm Circles - 1 minute (30 seconds per direction)",
    "pre-workout-3-step1": "Stand with feet shoulder-width apart, arms extended out to the sides.",
    "pre-workout-3-step2": "Rotate arms in small forward circles for 30 seconds, then reverse for 30 seconds.",
    "pre-workout-3-step3": "Keep movements controlled and shoulders relaxed.",
    "pre-workout-3-tip-label": "Tip:",
    "pre-workout-3-tip": "Gradually increase circle size to warm up shoulders.",
    "pre-workout-4-title": "4. Leg Swings - 1 minute (30 seconds per leg)",
    "pre-workout-4-step1": "Stand on one leg, holding a wall or chair for balance if needed.",
    "pre-workout-4-step2": "Swing the other leg forward and back in a controlled motion, keeping it straight.",
    "pre-workout-4-step3": "Perform for 30 seconds, then switch legs.",
    "pre-workout-4-tip-label": "Tip:",
    "pre-workout-4-tip": "Keep swings smooth to avoid jerking.",
    "pre-workout-5-title": "5. Torso Twists - 1 minute",
    "pre-workout-5-step1": "Stand with feet hip-width apart, hands on hips or arms extended out.",
    "pre-workout-5-step2": "Rotate your upper body side to side, keeping hips stable.",
    "pre-workout-5-step3": "Move continuously for 1 minute, engaging your core.",
    "pre-workout-5-tip-label": "Tip:",
    "pre-workout-5-tip": "Look in the direction of the twist to engage your spine.",
    "pre-workout-6-title": "6. High Knees - 1 minute",
    "pre-workout-6-step1": "Stand tall and march in place, lifting knees to hip height.",
    "pre-workout-6-step2": "Swing opposite arms for balance, keeping a steady pace.",
    "pre-workout-6-step3": "Continue for 1 minute to warm up hips and legs.",
    "pre-workout-6-tip-label": "Tip:",
    "pre-workout-6-tip": "Keep core engaged to maintain posture.",
    "pre-workout-7-title": "7. Dynamic Side Lunges - 1 minute (30 seconds per side)",
    "pre-workout-7-step1": "Stand with feet together, then step one foot out to the side into a lunge.",
    "pre-workout-7-step2": "Lower hips, keeping the other leg straight, then return to standing.",
    "pre-workout-7-step3": "Alternate sides for 30 seconds each, moving fluidly.",
    "pre-workout-7-tip-label": "Tip:",
    "pre-workout-7-tip": "Keep chest up and avoid leaning forward.",
    "workout-title": "10-Minute Bodyweight Workout",
    "workout-desc": "This 10-minute workout boosts energy, strength, and mood. Perform each exercise for 1 minute, completing the circuit twice with a 1-minute rest between rounds.",
    "workout-1-title": "1. Jumping Jacks - 1 minute",
    "workout-1-step1": "Stand with feet together, arms at your sides.",
    "workout-1-step2": "Jump, spreading legs and raising arms overhead.",
    "workout-1-step3": "Return to starting position and repeat rapidly.",
    "workout-1-tip-label": "Tip:",
    "workout-1-tip": "Keep movements controlled to avoid strain.",
    "workout-2-title": "2. Push-Ups - 1 minute",
    "workout-2-step1": "Start in a plank position, hands shoulder-width apart.",
    "workout-2-step2": "Lower chest to just above the ground, elbows at a 45-degree angle.",
    "workout-2-step3": "Push back up to the starting position.",
    "workout-2-tip-label": "Tip:",
    "workout-2-tip": "Modify on knees if needed, but keep a straight body line.",
    "workout-3-title": "3. Bodyweight Squats - 1 minute",
    "workout-3-step1": "Stand with feet shoulder-width apart, toes slightly out.",
    "workout-3-step2": "Lower hips until thighs are parallel to the ground, keeping chest up.",
    "workout-3-step3": "Push through heels to stand back up.",
    "workout-3-tip-label": "Tip:",
    "workout-3-tip": "Keep knees behind toes to protect joints.",
    "workout-4-title": "4. Mountain Climbers - 1 minute",
    "workout-4-step1": "Start in a plank position, hands under shoulders.",
    "workout-4-step2": "Drive one knee toward your chest, then quickly switch legs.",
    "workout-4-step3": "Continue alternating as fast as possible while keeping core tight.",
    "workout-4-tip-label": "Tip:",
    "workout-4-tip": "Avoid bouncing; keep movements smooth.",
    "workout-5-title": "5. Plank Hold - 1 minute",
    "workout-5-step1": "Lie face down, then prop yourself on forearms and toes.",
    "workout-5-step2": "Keep body in a straight line, engaging core and glutes.",
    "workout-5-step3": "Hold for the full minute, breathing steadily.",
    "workout-5-tip-label": "Tip:",
    "workout-5-tip": "Drop to knees if needed, but keep hips level.",
    "post-workout-title": "5-Minute Post-Workout Stretching Routine",
    "post-workout-desc": "Finish with this 5-minute static stretching routine to improve flexibility, reduce muscle tension, and aid recovery. Hold each stretch for 1 minute, breathing deeply.",
    "post-workout-1-title": "1. Standing Quad Stretch - 1 minute (30 seconds per leg)",
    "post-workout-1-step1": "Stand on one leg, holding a wall or chair for balance if needed.",
    "post-workout-1-step2": "Pull one foot toward your glutes, holding the ankle with the same-side hand.",
    "post-workout-1-step3": "Keep knees aligned and push hips slightly forward to feel the stretch in the quad.",
    "post-workout-1-tip-label": "Tip:",
    "post-workout-1-tip": "Keep your torso upright and avoid pulling too hard.",
    "post-workout-2-title": "2. Standing Hamstring Stretch - 1 minute (30 seconds per leg)",
    "post-workout-2-step1": "Stand and extend one leg straight in front of you, resting the heel on the ground.",
    "post-workout-2-step2": "Hinge at the hips, keeping the extended leg straight, and reach toward your toes.",
    "post-workout-2-step3": "Feel the stretch in the back of your thigh (hamstring).",
    "post-workout-2-tip-label": "Tip:",
    "post-workout-2-tip": "Keep your back straight to avoid strain.",
    "post-workout-3-title": "3. Chest Opener Stretch - 1 minute",
    "post-workout-3-step1": "Stand tall and clasp your hands behind your back, straightening your arms.",
    "post-workout-3-step2": "Lift your hands slightly and pull your shoulders back to open your chest.",
    "post-workout-3-step3": "Feel the stretch across your chest and shoulders.",
    "post-workout-3-tip-label": "Tip:",
    "post-workout-3-tip": "Keep your neck relaxed and breathe deeply.",
    "post-workout-4-title": "4. Side Body Stretch - 1 minute (30 seconds per side)",
    "post-workout-4-step1": "Stand with feet hip-width apart, raising one arm overhead.",
    "post-workout-4-step2": "Lean gently to the opposite side, stretching the side of your torso.",
    "post-workout-4-step3": "Keep hips stable and avoid twisting your body.",
    "post-workout-4-tip-label": "Tip:",
    "post-workout-4-tip": "Reach upward to maximize the stretch along your side.",
    "post-workout-4-step5": "Switch sides after 30 seconds.",
    "post-workout-5-title": "5. Standing Forward Fold - 1 minute",
    "post-workout-5-step1": "Stand with feet hip-width apart, hinge at the hips, and fold forward.",
    "post-workout-5-step2": "Let your head and arms hang toward the ground, relaxing your neck.",
    "post-workout-5-step3": "Feel the stretch in your hamstrings, lower back, and calves.",
    "post-workout-5-tip-label": "Tip:",
    "post-workout-5-tip": "Bend knees slightly if your hamstrings feel tight.",
    "tips-title": "Workout & Stretch Tips",
    "tips-1": "<strong>Pre-Workout:</strong> Perform dynamic stretches smoothly to warm up and align the spine and neck.",
    "tips-2": "<strong>Form First:</strong> Prioritize proper form during exercises to maintain spinal alignment and prevent injury.",
    "tips-3": "<strong>Post-Workout Stretch:</strong> Ease into static stretches without forcing; stop if you feel pain.",
    "tips-4": "<strong>Hydrate:</strong> Drink water before and after to stay energized.",
    "tips-5": "<strong>Progress:</strong> Increase workout intensity by adding a third round as you get stronger.",
    "footer": "© 2025 Morning Workout & Stretch Guide | No Equipment Needed"
  }
}
